_org/_posts/2016-08-20-make.org
#+STARTUP: showall
#+OPTIONS: toc:nil

#+BEGIN_HTML
---
layout: post
title: "Make"
date:   2016-08-20 13:00:00
---
#+END_HTML

#+BEGIN_HTML
<style>
pre {
  line-height: 1.5em;
}

pre.src-sh:before {
  content: "> ";
  font-weight: bold;
}

pre.example {
  margin-top: -10px;
  background-color: #e7ecf1;
  border: 15px solid #f3f3f3;
  border-top: 2px;
}

pre.example:before {
  content: "Output ";
  font-weight: bold;
}

.tip {
  padding: 10px 40px;
}

.tip:bfore {
  content: "Tip ";
  font-weight: bold;
}

</style>
#+END_HTML

I've used [[https://www.gnu.org/software/make/][Make]] in a range of projects -- some large, some tiny -- and
I've been happy with the results. Over time, through colleagues and
books, I've picked up a few tricks and found a nice way to think about
your Makefile(s). However, it's only about a year ago that I really
got Make under my skin and felt I understood the power of Make and
what problems it solves nicely. I'm putting down my thoughts here in a
way that I believe past-Mads would've found helpful; it might have
helped him appreciate Make a little faster.

If you want to get into some deeper aspects of Make after reading this
I highly recommend the book [[http://shop.oreilly.com/product/9780596006105.do][Managing Projcts with GNU Make 3rd
edition]]. Furthermore you can always dig into a specific topic by
consulting the [[https://www.gnu.org/software/make/manual/html_node/index.html][Make documentation]] -- I will link to the specific
sections where relevant but I won't cover all of the features that
Make has to offer so feel free to go explore.

#+TOC: headlines 2

** Why Make is Still Useful Today
Make is a programming language agnostic tool that provides a simple
set of abstractions for describing the relationships between the
source files in your project and the artifacts you wish to
produce. This makes it a very useful tool for automating the
development work-flow as well as the deployment pipeline of a given
project. Ideally getting started on a project should be a simple
matter of executing a single shell command which installs the required
tools, configure the project and build the required artifacts; nobody
likes having to go through a 14 steps ~README~ in order to get a
project up and running -- the same goes for deploying your code to
production.

However, having been created in 1977, Make can at times feel extremely
archaic. It's fair to assume that it must have been surpassed by more
modern tools. You are probably using a more recent programming
language specific build tool such as [[http://www.scala-sbt.org/][SBT]] for Scala, [[http://leiningen.org/][Leinigen]] for
Clojure, [[https://www.rebar3.org/][Rebar3]] for Erlang, [[https://webpack.github.io/][Webpack]] for web assets, etc. These tools
solve the task of turning your source files into an artifact that you
can run and deploy. For this specific task I don't recommend that you
use Make, but rather that you should use Make to automate the use of
these tools.

In the next section I'll introduce Make in the way that I like to
think of it -- as a programming language.

** Make as a Programming Language
I like to think of Make as a declarative string-oriented functional
programming language with very good support for executing shell
commands. It's a programming language that happens to be very good at
creating build systems 😉

You write your Make program in a file called a ~Makefile~. The purpose
of your ~Makefile~ is to describe a [[https://en.wikipedia.org/wiki/Dependency_graph][dependency graph]] of your build
artifacts and source files such that Make knows how and when to build
a specific artifact. The dependency graph is specified using rules --
this is what I think of as the declarative part of Make. In order to
specify these rules concisely Make has a string-oriented functional
programming language that is mostly used to compute the value of
variables that can then be used when defining rules.

Once you have your ~Makefile~ you invoke Make like so

#+begin_src sh
make my_file
#+end_src

where ~my_file~ is the name of the file you want Make to
produce. Based on your Makefile Make computes and traverses the
dependency graph of ~my_file~ in order to figure how and if it should
produce ~my_file~.

Let's start by having a look at the language used to specify the
rules.

*** The Rule Language
In your ~Makefile~ you declare your [[https://www.gnu.org/software/make/manual/html_node/Rules.html#Rules][rules]] using the following syntax.

#+begin_src makefile
target: prerequisite1 ... prerequisiteN
	command1
	...
	commandN
#+end_src

The ~target~ is the name of the file you want to produce. The
~prerequisites~ are the files that are required to produce the
~taget~. The ~commands~ (also known as the recipe) are the shell
commands Make should run in order to produce the target.

Image you have a project where you need to convert a [[Https://daringfireball.net/projects/markdown/][Markdown]] file to
HTML. The following rule would achieve this (assuming you have a
program called ~marked~ on your system).

#+begin_src makefile
index.html: index.md
	marked --input index.md --output index.html
#+end_src

This tells Make that it can produce a file named ~index.html~ if a
file named ~index.md~ exists and that it can produce it using the
shell command ~marked --input index.md --output
index.html~. Additionally Make knows that if ~index.md~ changes it
should re-produce the ~index.html~ file. An important note is that
each command in the recipe (is this case there's just one) should be
prefixed with a tab -- it's one of the many archaic aspects of Make.

A rule doesn't necessarily have to contain a recipe, the following is
a perfectly valid rule.

#+begin_src makefile
build: index.html about-me/index.html posts/hello-world/index.html
#+end_src

This simply tells Make that there's a target called ~build~ and that
it should consider it satisfied if all the prerequisites are
satisfied. Targets like these makes it possible to provide a nice
interface to your ~Makefile~ -- you can now invoke ~make build~ instead
of ~make index.html about-me/index.html posts/hello-world/index.html~.

