_posts/2016-08-20-make.html
---
layout: post
title: "Make"
date:   2016-08-20 13:00:00
---

<style>
pre {
  line-height: 1.5em;
}

pre.src-sh:before {
  content: "> ";
  font-weight: bold;
}

pre.example {
  margin-top: -10px;
  background-color: #e7ecf1;
  border: 15px solid #f3f3f3;
  border-top: 2px;
}

pre.example:before {
  content: "Output ";
  font-weight: bold;
}

.tip {
  padding: 10px 40px;
}

.tip:bfore {
  content: "Tip ";
  font-weight: bold;
}

</style>

<p>
I've used <a href="https://www.gnu.org/software/make/">Make</a> in a range of projects &#x2013; some large, some tiny &#x2013; and
I've been happy with the results. Over time, through colleagues and
books, I've picked up a few tricks and found a nice way to think about
your Makefile(s). However, it's only about a year ago that I really
got Make under my skin and felt I understood the power of Make and
what problems it solves nicely. I'm putting down my thoughts here in a
way that I believe past-Mads would've found helpful; it might have
helped him appreciate Make a little faster.
</p>

<p>
If you want to get into some deeper aspects of Make after reading this
I highly recommend the book <a href="http://shop.oreilly.com/product/9780596006105.do">Managing Projcts with GNU Make 3rd
edition</a>. Furthermore you can always dig into a specific topic by
consulting the <a href="https://www.gnu.org/software/make/manual/html_node/index.html">Make documentation</a> &#x2013; I will link to the specific
sections where relevant but I won't cover all of the features that
Make has to offer so feel free to go explore.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Why Make is Still Useful Today</a></li>
<li><a href="#sec-2">2. Make as a Programming Language</a>
<ul>
<li><a href="#sec-2-1">2.1. The Rule Language</a></li>
<li><a href="#sec-2-2">2.2. String-oriented functional programming</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Example &#x2013; A Static Website</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Why Make is Still Useful Today</h2>
<div class="outline-text-2" id="text-1">
<p>
Make is a programming language agnostic tool that provides a simple
set of abstractions for describing the relationships between the
source files in your project and the artifacts you wish to
produce. This makes it a very useful tool for automating the
development work-flow as well as the deployment pipeline of a given
project. Ideally getting started on a project should be a simple
matter of executing a single shell command which installs the required
tools, configure the project and build the required artifacts; nobody
likes having to go through a 14 steps <code>README</code> in order to get a
project up and running &#x2013; the same goes for deploying your code to
production.
</p>

<p>
However, having been created in 1977, Make can at times feel extremely
archaic. It's fair to assume that it must have been surpassed by more
modern tools. You are probably using a more recent programming
language specific build tool such as <a href="http://www.scala-sbt.org/">SBT</a> for Scala, <a href="http://leiningen.org/">Leinigen</a> for
Clojure, <a href="https://www.rebar3.org/">Rebar3</a> for Erlang, <a href="https://webpack.github.io/">Webpack</a> for web assets, etc. These tools
solve the task of turning your source files into an artifact that you
can run and deploy. For this specific task I don't recommend that you
use Make, but rather that you should use Make to automate the use of
these tools.
</p>

<p>
In the next section I'll introduce Make in the way that I like to
think of it &#x2013; as a programming language.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Make as a Programming Language</h2>
<div class="outline-text-2" id="text-2">
<p>
I like to think of Make as a declarative string-oriented functional
programming language with very good support for executing shell
commands. It's a programming language that happens to be very good at
creating build systems 😉
</p>

<p>
You write your Make program in a file called a <code>Makefile</code>. The purpose
of your <code>Makefile</code> is to describe a <a href="https://en.wikipedia.org/wiki/Dependency_graph">dependency graph</a> of your build
artifacts and source files such that Make knows how and when to build
a specific artifact. The dependency graph is specified using rules &#x2013;
this is what I think of as the declarative part of Make. In order to
specify these rules concisely Make has a string-oriented functional
programming language that is mostly used to compute the value of
variables that can then be used when defining rules.
</p>

<p>
Once you have your <code>Makefile</code> you invoke Make like so
</p>

<div class="org-src-container">

<pre class="src src-sh">make my_file
</pre>
</div>

<p>
where <code>my_file</code> is the name of the file you want Make to
produce. Based on your Makefile Make computes and traverses the
dependency graph of <code>my_file</code> in order to figure how and if it should
produce <code>my_file</code>.
</p>

<p>
Let's start by having a look at the language used to specify the
rules.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The Rule Language</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In your <code>Makefile</code> you declare your <a href="https://www.gnu.org/software/make/manual/html_node/Rules.html#Rules">rules</a> using the following syntax.
</p>

<div class="org-src-container">

<pre class="src src-makefile">target: prerequisite1 ... prerequisiteN
	command1
	...
	commandN
</pre>
</div>

<p>
The <code>target</code> is the name of the file you want to produce. The
<code>prerequisites</code> are the files that are required to produce the
<code>taget</code>. The <code>commands</code> (also known as the recipe) are the shell
commands Make should run in order to produce the target.
</p>

<p>
Image you have a project where you need to convert a <a href="//daringfireball.net/projects/markdown/">Markdown</a> file to
HTML. The following rule would achieve this (assuming you have a
program called <code>marked</code> on your system).
</p>

<div class="org-src-container">

<pre class="src src-makefile">index.html: index.md
	marked --input index.md --output index.html
</pre>
</div>

<p>
This tells Make that it can produce a file named <code>index.html</code> if a
file named <code>index.md</code> exists and that it can produce it using the
shell command <code>marked --input index.md --output
index.html</code>. Additionally Make knows that if <code>index.md</code> changes it
should re-produce the <code>index.html</code> file. An important note is that
each command in the recipe (is this case there's just one) should be
prefixed with a tab &#x2013; it's one of the many archaic aspects of Make.
</p>

<p>
A rule doesn't necessarily have to contain a recipe, the following is
a perfectly valid rule.
</p>

<div class="org-src-container">

<pre class="src src-makefile">build: index.html about-me/index.html posts/hello-world/index.html
</pre>
</div>

<p>
This simply tells Make that there's a target called <code>build</code> and that
it should consider it satisfied if all the prerequisites are
satisfied. Targets like these makes it possible to provide a nice
interface to your <code>Makefile</code> &#x2013; you can now invoke <code>make build</code> instead
of <code>make index.html about-me/index.html posts/hello-world/index.html</code>.
</p>
</div>
