_org/_posts/2016-08-20-make.org
**** Implicit Rules
With the rules you've seen so far you can imagine that your ~Makefile~
gets a bit long as the number of Markdown files increase as you have
to explicitly describe the relationship between each Markdown and HTML
file.

#+begin_src makefile
build: index.html about-me/index.html posts/hello-world/index.html

index.html: index.md
	marked --input index.md --output index.html

about-me/index.html: about-me/index.md
	marked --input about-me/index.md --output about-me/index.html

posts/hello-world/index.html: posts/hello-world/index.md
	marked --input posts/hello-world/index.md --output posts/hello-world/index.html
#+end_src

For cases like these you can define a [[https://www.gnu.org/software/make/manual/html_node/Pattern-Rules.html#Pattern-Rules][pattern rule]] (one of many types
of [[https://www.gnu.org/software/make/manual/html_node/Implicit-Rules.html#Implicit-Rules][implicit rule]] that Make has) instead and get a nice and succinct
~Makefile~.

#+begin_src makefile
build: index.html about-me/index.html posts/hello-world/index.html

%.html: %.md
	marked --input $< --output $@
#+end_src

The [[https://www.gnu.org/software/make/manual/html_node/Pattern-Rules.html#Pattern-Rules][pattern rule]] ~%.html: %.md~ tells Make that it can generate an
~.html~ file from a ~.md~ file of the same name using the body of the
rule. The symbols ~$<~ and ~$@~ are [[https://www.gnu.org/software/make/manual/html_node/Automatic-Variables.html][automatic variables]] that expand to
the name of the left-most prerequisite and the name of the target
respectively. More on variables later.

**** Auto-generating prerequisites

There are cases where managing the lists of prerequisites of a target
can become cumbersome and error-prone. A solution to this problem is
to generate prerequisites automatically for some targets. This can be
achieved using the [[https://www.gnu.org/software/make/manual/html_node/Include.html#Include][~include~]] directive.

The ~include~ directive tells Make to read another ~Makefile~ -- an
example would be ~include foobar.mk~. Before reading the ~Makefile~
~foobar.mk~ it checks if there exists a rule that can produce
~foobar.mk~. If such a rule exists it will reproduce ~foobar.mk~
before including.

This makes it possible to automatically generate a ~Makefile~ that
declares prerequisites and then import it. A tool that produces such a
~Makefile~ has historically been called ~make-depend~.

This is a little out of scope for this blog post so head over to
[[https://www.gnu.org/software/make/manual/html_node/Automatic-Prerequisites.html#Automatic-Prerequisites][Generating Prerequisites Automatically]] to read more about this; I only
mention it here as it's something you are likely to need in a more
complex build systems.

*** String-oriented functional programming
So the dependency graph is specified through rules. Let's have a look
at the language features that Make has that enables you to write nice
concise ~Makefiles~.

**** Variables
There are two kinds of variables in Make -- [[https://www.gnu.org/software/make/manual/html_node/Flavors.html#Flavors][simple and recursive]] --
they differ in the way they're expanded when referenced. There are
four different operators that can be used when assigning values to
variables.

*~:=~ assignment operator* In the example ~python :=
python$(PYTHON_VERSION)~ the ~:=~ assignment operator will set the
value of ~python~ to ~python2.7~ given the value of ~PYTHON_VERSION~
is set to ~2.7~. That is, the right-hand side is evaluated during the
assignment of the variable.

*= assignment operator* In the example ~python =
python$(PYTHON_VERSION)~ the ~=~ assignment operator won't evaluate
the right-hand side but rather set the value of ~python~ to
~python$(PYTHON_VERSION)~ and the final expansion of ~python~ depends
on the value of the variable ~PYTHON_VERSION~ when the variable
~python~ is referenced. You can think of this as lazy evaluation as
you might be used to from using the ~lazy~ keyword in [[http://www.scala-lang.org/][Scala]] (or if
you've used [[https://www.haskell.org/][Haskell]]). Some good advice is to only use ~=~ if you
really have to. Otherwise stick to the other operators.

*~?=~ conditional variable assignment operator* In the example
~PYTHON_VERSION ?= 2.7~ the conditional assignment operator will set
the value of ~PYTHON_VERSION~ to ~2.7~ unless ~PYTHON_VERSION~ is
already defined as an environment variable.

*~+=~ append operator* In the example ~foo += bar baz~ Make will
append ~bar baz~ to the current value of ~foo~. For simple variables
this is simply a shorthand for ~foo := $(foo) bar baz~ but for
recursive variables the operator will still do the right thing without
crashing in an infinite evaluation of ~foo~.

There's a convention that words in variables should be
~separated_by_underscores~ and that variables that a user might want
to customize should be written using ~UPPERCASE~ letters.

When you reference a variable it is expanded in-place -- In that sense
a Make variable is similar to variables as you know them from
templating languages such as [[http://jinja.pocoo.org/docs/dev/][jinja2]] or [[http://www.embeddedjs.com/][ejs]]. The syntax for referencing a
variable is ~$(variable_name)~.

In adittion to the variables you define Make has a set of variables
that are called [[https://www.gnu.org/software/make/manual/html_node/Automatic-Variables.html][automatic variables]]. These are variables that change
value based on the rule that is currently being executed.

**** Functions
Make contains a bunch of [[https://www.gnu.org/software/make/manual/html_node/Functions.html#Functions][built-in functions]] and it's worth reading
through them as it will make your ~Makefile~ much more concise,
especially the [[https://www.gnu.org/software/make/manual/html_node/File-Name-Functions.html#File-Name-Functions][File Name Functions]].

The syntax for calling a functions is ~$(function-name arg1, ...,
argN)~.

It is possbile to define your own functions. A user-defined function
is really just a variable that is defined in such a way that it's
intended to be used with the built-in [[https://www.gnu.org/software/make/manual/html_node/Call-Function.html#Call-Function][~call~]] function. So when you're
calling a user-defined functions the pattern is ~$(call variable-name,
param1, ..., paramN)~

The following shows how to define a function. The arguments to the function
are available through the variables ~$1~, ~$2~, etc.

#+begin_src makefile
# $(call print-rule, variable, extra)
#   Used to decorate the output before printing it to stdout.
define print-rule
	@echo "[$(shell date +%H:%M:%S)] $(strip $1): $(strip $2)"
endef
#+end_src

There's a convention that user-defined functions use lowercase-words
separated-by-dashes.

