_posts/2016-08-20-make.html

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Implicit Rules</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
With the rules you've seen so far you can imagine that your <code>Makefile</code>
gets a bit long as the number of Markdown files increase as you have
to explicitly describe the relationship between each Markdown and HTML
file.
</p>

<div class="org-src-container">

<pre class="src src-makefile">build: index.html about-me/index.html posts/hello-world/index.html

index.html: index.md
	marked --input index.md --output index.html

about-me/index.html: about-me/index.md
	marked --input about-me/index.md --output about-me/index.html

posts/hello-world/index.html: posts/hello-world/index.md
	marked --input posts/hello-world/index.md --output posts/hello-world/index.html
</pre>
</div>

<p>
For cases like these you can define a <a href="https://www.gnu.org/software/make/manual/html_node/Pattern-Rules.html#Pattern-Rules">pattern rule</a> (one of many types
of <a href="https://www.gnu.org/software/make/manual/html_node/Implicit-Rules.html#Implicit-Rules">implicit rule</a> that Make has) instead and get a nice and succinct
<code>Makefile</code>.
</p>

<div class="org-src-container">

<pre class="src src-makefile">build: index.html about-me/index.html posts/hello-world/index.html

%.html: %.md
	marked --input $&lt; --output $@
</pre>
</div>

<p>
The <a href="https://www.gnu.org/software/make/manual/html_node/Pattern-Rules.html#Pattern-Rules">pattern rule</a> <code>%.html: %.md</code> tells Make that it can generate an
<code>.html</code> file from a <code>.md</code> file of the same name using the body of the
rule. The symbols <code>$&lt;</code> and <code>$@</code> are <a href="https://www.gnu.org/software/make/manual/html_node/Automatic-Variables.html">automatic variables</a> that expand to
the name of the left-most prerequisite and the name of the target
respectively. More on variables later.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Auto-generating prerequisites</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
There are cases where managing the lists of prerequisites of a target
can become cumbersome and error-prone. A solution to this problem is
to generate prerequisites automatically for some targets. This can be
achieved using the <a href="https://www.gnu.org/software/make/manual/html_node/Include.html#Include"><code>include</code></a> directive.
</p>

<p>
The <code>include</code> directive tells Make to read another <code>Makefile</code> &#x2013; an
example would be <code>include foobar.mk</code>. Before reading the <code>Makefile</code>
<code>foobar.mk</code> it checks if there exists a rule that can produce
<code>foobar.mk</code>. If such a rule exists it will reproduce <code>foobar.mk</code>
before including.
</p>

<p>
This makes it possible to automatically generate a <code>Makefile</code> that
declares prerequisites and then import it. A tool that produces such a
<code>Makefile</code> has historically been called <code>make-depend</code>.
</p>

<p>
This is a little out of scope for this blog post so head over to
<a href="https://www.gnu.org/software/make/manual/html_node/Automatic-Prerequisites.html#Automatic-Prerequisites">Generating Prerequisites Automatically</a> to read more about this; I only
mention it here as it's something you are likely to need in a more
complex build systems.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> String-oriented functional programming</h3>
<div class="outline-text-3" id="text-2-2">
<p>
So the dependency graph is specified through rules. Let's have a look
at the language features that Make has that enables you to write nice
concise <code>Makefiles</code>.
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Variables</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
There are two kinds of variables in Make &#x2013; <a href="https://www.gnu.org/software/make/manual/html_node/Flavors.html#Flavors">simple and recursive</a> &#x2013;
they differ in the way they're expanded when referenced. There are
four different operators that can be used when assigning values to
variables.
</p>

<p>
<b><code>:=</code> assignment operator</b> In the example <code>python :=
python$(PYTHON_VERSION)</code> the <code>:=</code> assignment operator will set the
value of <code>python</code> to <code>python2.7</code> given the value of <code>PYTHON_VERSION</code>
is set to <code>2.7</code>. That is, the right-hand side is evaluated during the
assignment of the variable.
</p>

<p>
<b>= assignment operator</b> In the example <code>python =
python$(PYTHON_VERSION)</code> the <code>=</code> assignment operator won't evaluate
the right-hand side but rather set the value of <code>python</code> to
<code>python$(PYTHON_VERSION)</code> and the final expansion of <code>python</code> depends
on the value of the variable <code>PYTHON_VERSION</code> when the variable
<code>python</code> is referenced. You can think of this as lazy evaluation as
you might be used to from using the <code>lazy</code> keyword in <a href="http://www.scala-lang.org/">Scala</a> (or if
you've used <a href="https://www.haskell.org/">Haskell</a>). Some good advice is to only use <code>=</code> if you
really have to. Otherwise stick to the other operators.
</p>

<p>
<b><code>?=</code> conditional variable assignment operator</b> In the example
<code>PYTHON_VERSION ?= 2.7</code> the conditional assignment operator will set
the value of <code>PYTHON_VERSION</code> to <code>2.7</code> unless <code>PYTHON_VERSION</code> is
already defined as an environment variable.
</p>

<p>
<b><code>+=</code> append operator</b> In the example <code>foo += bar baz</code> Make will
append <code>bar baz</code> to the current value of <code>foo</code>. For simple variables
this is simply a shorthand for <code>foo := $(foo) bar baz</code> but for
recursive variables the operator will still do the right thing without
crashing in an infinite evaluation of <code>foo</code>.
</p>

<p>
There's a convention that words in variables should be
<code>separated_by_underscores</code> and that variables that a user might want
to customize should be written using <code>UPPERCASE</code> letters.
</p>

<p>
When you reference a variable it is expanded in-place &#x2013; In that sense
a Make variable is similar to variables as you know them from
templating languages such as <a href="http://jinja.pocoo.org/docs/dev/">jinja2</a> or <a href="http://www.embeddedjs.com/">ejs</a>. The syntax for referencing a
variable is <code>$(variable_name)</code>.
</p>

<p>
In adittion to the variables you define Make has a set of variables
that are called <a href="https://www.gnu.org/software/make/manual/html_node/Automatic-Variables.html">automatic variables</a>. These are variables that change
value based on the rule that is currently being executed.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Functions</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Make contains a bunch of <a href="https://www.gnu.org/software/make/manual/html_node/Functions.html#Functions">built-in functions</a> and it's worth reading
through them as it will make your <code>Makefile</code> much more concise,
especially the <a href="https://www.gnu.org/software/make/manual/html_node/File-Name-Functions.html#File-Name-Functions">File Name Functions</a>.
</p>

<p>
The syntax for calling a functions is <code>$(function-name arg1, ...,
argN)</code>.
</p>

<p>
It is possbile to define your own functions. A user-defined function
is really just a variable that is defined in such a way that it's
intended to be used with the built-in <a href="https://www.gnu.org/software/make/manual/html_node/Call-Function.html#Call-Function"><code>call</code></a> function. So when you're
calling a user-defined functions the pattern is <code>$(call variable-name,
param1, ..., paramN)</code>
</p>

<p>
The following shows how to define a function. The arguments to the function
are available through the variables <code>$1</code>, <code>$2</code>, etc.
</p>

<div class="org-src-container">

<pre class="src src-makefile"># $(call print-rule, variable, extra)
#   Used to decorate the output before printing it to stdout.
define print-rule
	@echo "[$(shell date +%H:%M:%S)] $(strip $1): $(strip $2)"
endef
</pre>
</div>

<p>
There's a convention that user-defined functions use lowercase-words
separated-by-dashes.
</p>
</div>
</div>
</div>
</div>
