_org/_posts/2016-08-20-make.org
** Example -- A Static Website
Let's see how all of this fits together. Let's create a Makefile for a
simple statically generated web-site based on [[https://daringfireball.net/projects/markdown/][Markdown]] files. You can find
this little example on [[https://github.com/mads-hartmann/mads-hartmann.github.com/tree/master/examples/markdown-site][Github]]. The project has the following structure.

#+begin_src :exports code
├── Makefile
└── site
    ├── make.md
    └── tools
        ├── osx
        │   └── homebrew.md
        └── xargs.md
#+end_src

For each Markdown file we want to generate a HTML file with an
appropriate path and put it in a folder named ~_build~.  For the
example above the result of building the site should be the following.

#+begin_src :exports code
_build
├── make
│   └── index.html
└── tools
    ├── osx
    │   └── homebrew
    │       └── index.html
    └── xargs
        └── index.html
#+end_src

This can be achieved with the following Makefile.

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile

Let's go through the Makefile step by step. First we define a single
variable that the user might be interested in changing (hence the
capitalized letters).

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile :lines "1-4"

We then go on to define a variable that contains the path of all of
the Markdown files in ~site~ and the sub-folders of ~site~. This is
achieved by using the very handy [[https://www.gnu.org/software/make/manual/html_node/Shell-Function.html][shell function]] which allows you to execute
a shell command and use the result in your Makefile. An alternative way to
find all Markdown files could've been to use the [[https://www.gnu.org/software/make/manual/html_node/Wildcard-Function.html#Wildcard-Function][wildcard built-in function]].

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile :lines "6-10"

Before we move on let's make sure we got the use of ~shell~ right
by inspecting the variable using the ~print-%~ target -- the ~print-%~ target
is something I copy-paste into all of my ~Makefiles~ as it's extremely useful
for debugging ~Makefiles~.

#+begin_src sh :exports both :prologue cd ../../examples/markdown-site
make print-markdown_sources
#+end_src
#+RESULTS:
: markdown_sources is site/make.md site/tools/osx/homebrew.md site/tools/xargs.md

Great, so we've successfully managed to capture the the filenames of
the Markdown files we want to process. Next up we use the
~markdown_sources~ variable to create a new variable that contains the
filenames of the HTML pages we want to generate.

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile :lines "10-15"

Here we're using some of the most commonly used built-in in
functions. We're using the [[https://www.gnu.org/software/make/manual/html_node/Text-Functions.html#Text-Functions][text-function]] ~subst~ to replace ~site/~
with ~_build/~. We're using the [[https://www.gnu.org/software/make/manual/html_node/File-Name-Functions.html#File-Name-Functions][file name functions]] ~dir~, ~notdir~
and ~basename~ to get the directory part of a path, the filename part
of a path and finally the filename part of a path without the
extension. We're using the the [[https://www.gnu.org/software/make/manual/html_node/Foreach-Function.html#Foreach-Function][foreach function]] to perform the
transformation on each path separately.

There's another very useful [[https://www.gnu.org/software/make/manual/html_node/Text-Functions.html#Text-Functions][text-function]] named ~patsubst~ which takes
a pattern instead of a string to perform substitution. Here's how to
use it to provide an alternative implementation of the variable
~html_pages~.

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile :lines "16-19"

In this case I think the use of ~patsubst~ yields the clearest result
but it depends on the situation so it's nice to keep both approaches
in your toolbox. Let's have a look at the value of both variables.

#+begin_src sh :results output verbatim :exports both :prologue cd ../../examples/markdown-site
make print-html_pages ; make print-html_pages_alternative
#+end_src
#+RESULTS:
: html_pages is _build/make/index.html _build/tools/osx/homebrew/index.html _build/tools/xargs/index.html
: html_pages_alternative is _build/make/index.html _build/tools/osx/homebrew/index.html _build/tools/xargs/index.html

With the variables in order we go on to define the targets that we
intend the user to call; this is the interface of the Makefile.

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile :lines "21-26"

The ~clean~, ~distclean~ and ~print-%~ are using a convenient syntax for
defining the recipe of a rule on the same line as the rule itself.

Notice that ~build~ depends on ~setup~ as well as ~$(html_pages)~
-- this means that if you were to run ~make build~ before having run
~make setup~ Make will ensure the the ~setup~ target is satisfied
before attempting to satisfy the targets in the ~html_pages~
variable; it's a small convenience this that means you have to
remember fewer targets as a developer.

Finally let's have a look at the rules.

#+INCLUDE: "../../examples/markdown-site/Makefile" src makefile :lines "29-36"

The first rule ~$(BUILD_DIR)/%/index.html: site/%.md~ describes how to
generate a HTML file from a Markdown file using a [[https://www.gnu.org/software/make/manual/html_node/Pattern-Rules.html#Pattern-Rules][pattern rule]]. The
recipe of the rule makes sure that the directory exists using ~mkdir -p~
before generating the HTML files using the NPM package [[https://github.com/chjj/marked][marked]]. The
prefix ~@~ of ~@mkdir~ tells Make not to output the command when
executing it. Notice we're using two automatic variables ~$@~ and
~$<~: The first is the name of the target, the second is the name of
the left-most prerequisite -- in our case there is only one and it's
the name of the Markdown file that should be used to generate the HTML
file.

The last rule ~node_modules/.installed: requirements.txt~ describe how
to install the NPM package(s) that we're using. The packages are
enumerated in a file named ~requirements.txt~. First we remove the
previously installed ~node_modules~, then we install the packages and
finally touch the ~node_modules/.installed~ file. The rule is using a
common pattern where we introduce an empty file (in this case
~node_modules/.installed~) which represents the successful execution
of the rules recipe. Here's the Makefile [[https://www.gnu.org/software/make/manual/html_node/Empty-Targets.html#Empty-Targets][manual section]] that describes
this pattern.

Here's a quick demonstration. We're running ~make distclean build~ to first
get a completely clean workspace and then build to show how Make installs
the NPM package before attempting to generate the output.

#+begin_src sh :results output verbatim :exports both :prologue cd ../../examples/markdown-site
make distclean build
#+end_src
#+RESULTS:
#+begin_example
rm -rf _build node_modules
rm -rf node_modules
npm install marked
/Users/hartmann/dev/mads-hartmann.github.com/examples/markdown-site
└── marked@0.3.6 

touch node_modules/.installed
node_modules/.bin/marked --input site/make.md --output _build/make/index.html
node_modules/.bin/marked --input site/tools/osx/homebrew.md --output _build/tools/osx/homebrew/index.html
node_modules/.bin/marked --input site/tools/xargs.md --output _build/tools/xargs/index.html
#+end_example

If we were to run ~make build~ again without changing any files then
Make is smart enough to know that nothing needs to be re-built.

#+begin_src sh :results output verbatim :exports both :prologue cd ../../examples/markdown-site
make build
#+end_src
#+RESULTS:
: make: Nothing to be done for `build'.

If we change a file Make is smart enough to only re-build that single
file.

#+begin_src sh :results output verbatim :exports both :prologue cd ../../examples/markdown-site
touch site/make.md ; make build
#+end_src
#+RESULTS:
: node_modules/.bin/marked --input site/make.md --output _build/make/index.html

And that's it.
