_posts/2016-08-20-make.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Example &#x2013; A Static Website</h2>
<div class="outline-text-2" id="text-3">
<p>
Let's see how all of this fits together. Let's create a Makefile for a
simple statically generated web-site based on <a href="https://daringfireball.net/projects/markdown/">Markdown</a> files. You can find
this little example on <a href="https://github.com/mads379/mads379.github.com/tree/master/examples/markdown-site">Github</a>. The project has the following structure.
</p>

<div class="org-src-container">

<pre class="src src-:exports">├── Makefile
└── site
    ├── make.md
    └── tools
        ├── osx
        │   └── homebrew.md
        └── xargs.md
</pre>
</div>

<p>
For each Markdown file we want to generate a HTML file with an
appropriate path and put it in a folder named <code>_build</code>.  For the
example above the result of building the site should be the following.
</p>

<div class="org-src-container">

<pre class="src src-:exports">_build
├── make
│   └── index.html
└── tools
    ├── osx
    │   └── homebrew
    │       └── index.html
    └── xargs
        └── index.html
</pre>
</div>

<p>
This can be achieved with the following Makefile.
</p>

<div class="org-src-container">

<pre class="src src-makefile">### User-changable variables.

BUILD_DIR := _build

### Variables

markdown_sources := \
	$(shell find site -name "*.md")

html_pages := \
	$(foreach f, $(markdown_sources), \
		$(subst site/,$(BUILD_DIR)/, \
			$(dir $(f)))$(basename $(notdir $(f)))/index.html)

# Alternative way to achieve the same thing as html_pages
html_pages_alternative := \
	$(patsubst site/%.md,$(BUILD_DIR)/%/index.html,$(markdown_sources))

### Targets

build: setup $(html_pages)
setup: node_modules/.installed
clean: ; rm -rf $(BUILD_DIR)
distclean: ; rm -rf $(BUILD_DIR) node_modules
print-%: ; @echo $* is $($*)

### Rules

$(BUILD_DIR)/%/index.html: site/%.md
	@mkdir -p $(dir $@)
	node_modules/.bin/marked --input $&lt; --output $@

node_modules/.installed: requirements.txt
	rm -rf node_modules
	npm install $(shell cat $&lt;)
	touch $@
</pre>
</div>

<p>
Let's go through the Makefile step by step. First we define a single
variable that the user might be interested in changing (hence the
capitalized letters).
</p>

<div class="org-src-container">

<pre class="src src-makefile">### User-changable variables.

BUILD_DIR := _build
</pre>
</div>

<p>
We then go on to define a variable that contains the path of all of
the Markdown files in <code>site</code> and the sub-folders of <code>site</code>. This is
achieved by using the very handy <a href="https://www.gnu.org/software/make/manual/html_node/Shell-Function.html">shell function</a> which allows you to execute
a shell command and use the result in your Makefile. An alternative way to
find all Markdown files could've been to use the <a href="https://www.gnu.org/software/make/manual/html_node/Wildcard-Function.html#Wildcard-Function">wildcard built-in function</a>.
</p>

<div class="org-src-container">

<pre class="src src-makefile">markdown_sources := \
	$(shell find site -name "*.md")
</pre>
</div>

<p>
Before we move on let's make sure we got the use of <code>shell</code> right
by inspecting the variable using the <code>print-%</code> target &#x2013; the <code>print-%</code> target
is something I copy-paste into all of my <code>Makefiles</code> as it's extremely useful
for debugging <code>Makefiles</code>.
</p>

<div class="org-src-container">

<pre class="src src-sh">make print-markdown_sources
</pre>
</div>
<pre class="example">
markdown_sources is site/make.md site/tools/osx/homebrew.md site/tools/xargs.md
</pre>

<p>
Great, so we've successfully managed to capture the the filenames of
the Markdown files we want to process. Next up we use the
<code>markdown_sources</code> variable to create a new variable that contains the
filenames of the HTML pages we want to generate.
</p>

<div class="org-src-container">

<pre class="src src-makefile">html_pages := \
	$(foreach f, $(markdown_sources), \
		$(subst site/,$(BUILD_DIR)/, \
			$(dir $(f)))$(basename $(notdir $(f)))/index.html)
</pre>
</div>

<p>
Here we're using some of the most commonly used built-in in
functions. We're using the <a href="https://www.gnu.org/software/make/manual/html_node/Text-Functions.html#Text-Functions">text-function</a> <code>subst</code> to replace <code>site/</code>
with <code>_build/</code>. We're using the <a href="https://www.gnu.org/software/make/manual/html_node/File-Name-Functions.html#File-Name-Functions">file name functions</a> <code>dir</code>, <code>notdir</code>
and <code>basename</code> to get the directory part of a path, the filename part
of a path and finally the filename part of a path without the
extension. We're using the the <a href="https://www.gnu.org/software/make/manual/html_node/Foreach-Function.html#Foreach-Function">foreach function</a> to perform the
transformation on each path separately.
</p>

<p>
There's another very useful <a href="https://www.gnu.org/software/make/manual/html_node/Text-Functions.html#Text-Functions">text-function</a> named <code>patsubst</code> which takes
a pattern instead of a string to perform substitution. Here's how to
use it to provide an alternative implementation of the variable
<code>html_pages</code>.
</p>

<div class="org-src-container">

<pre class="src src-makefile">html_pages_alternative := \
	$(patsubst site/%.md,$(BUILD_DIR)/%/index.html,$(markdown_sources))
</pre>
</div>

<p>
In this case I think the use of <code>patsubst</code> yields the clearest result
but it depends on the situation so it's nice to keep both approaches
in your toolbox. Let's have a look at the value of both variables.
</p>

<div class="org-src-container">

<pre class="src src-sh">make print-html_pages ; make print-html_pages_alternative
</pre>
</div>
<pre class="example">
html_pages is _build/make/index.html _build/tools/osx/homebrew/index.html _build/tools/xargs/index.html
html_pages_alternative is _build/make/index.html _build/tools/osx/homebrew/index.html _build/tools/xargs/index.html
</pre>

<p>
With the variables in order we go on to define the targets that we
intend the user to call; this is the interface of the Makefile.
</p>

<div class="org-src-container">

<pre class="src src-makefile">build: setup $(html_pages)
setup: node_modules/.installed
clean: ; rm -rf $(BUILD_DIR)
distclean: ; rm -rf $(BUILD_DIR) node_modules
print-%: ; @echo $* is $($*)
</pre>
</div>

<p>
The <code>clean</code>, <code>distclean</code> and <code>print-%</code> are using a convenient syntax for
defining the recipe of a rule on the same line as the rule itself.
</p>

<p>
Notice that <code>build</code> depends on <code>setup</code> as well as <code>$(html_pages)</code>
&#x2013; this means that if you were to run <code>make build</code> before having run
<code>make setup</code> Make will ensure the the <code>setup</code> target is satisfied
before attempting to satisfy the targets in the <code>html_pages</code>
variable; it's a small convenience this that means you have to
remember fewer targets as a developer.
</p>

<p>
Finally let's have a look at the rules.
</p>

<div class="org-src-container">

<pre class="src src-makefile">$(BUILD_DIR)/%/index.html: site/%.md
	@mkdir -p $(dir $@)
	node_modules/.bin/marked --input $&lt; --output $@

node_modules/.installed: requirements.txt
	rm -rf node_modules
	npm install $(shell cat $&lt;)
</pre>
</div>

<p>
The first rule <code>$(BUILD_DIR)/%/index.html: site/%.md</code> describes how to
generate a HTML file from a Markdown file using a <a href="https://www.gnu.org/software/make/manual/html_node/Pattern-Rules.html#Pattern-Rules">pattern rule</a>. The
recipe of the rule makes sure that the directory exists using <code>mkdir -p</code>
before generating the HTML files using the NPM package <a href="https://github.com/chjj/marked">marked</a>. The
prefix <code>@</code> of <code>@mkdir</code> tells Make not to output the command when
executing it. Notice we're using two automatic variables <code>$@</code> and
<code>$&lt;</code>: The first is the name of the target, the second is the name of
the left-most prerequisite &#x2013; in our case there is only one and it's
the name of the Markdown file that should be used to generate the HTML
file.
</p>

<p>
The last rule <code>node_modules/.installed: requirements.txt</code> describe how
to install the NPM package(s) that we're using. The packages are
enumerated in a file named <code>requirements.txt</code>. First we remove the the
previously installed <code>node_modules</code>, then we install the packages and
finally touch the <code>node_modules/.installed</code> file. The rule is using a
common pattern where we introduce an empty file (in this case
<code>node_modules/.installed</code>) which represents the successful execution
of the rules recipe. Here's the Makefile <a href="https://www.gnu.org/software/make/manual/html_node/Empty-Targets.html#Empty-Targets">manual section</a> that describes
this pattern.
</p>

<p>
Here's a quick demonstration. We're running <code>make distclean build</code> to first
get a completely clean workspace and then build to show how Make installs
the NPM package before attempting to generate the output.
</p>

<div class="org-src-container">

<pre class="src src-sh">make distclean build
</pre>
</div>
<pre class="example">
rm -rf _build node_modules
rm -rf node_modules
npm install marked
/Users/hartmann/dev/mads379.github.com/examples/markdown-site
└── marked@0.3.6 

touch node_modules/.installed
node_modules/.bin/marked --input site/make.md --output _build/make/index.html
node_modules/.bin/marked --input site/tools/osx/homebrew.md --output _build/tools/osx/homebrew/index.html
node_modules/.bin/marked --input site/tools/xargs.md --output _build/tools/xargs/index.html
</pre>

<p>
If we were to run <code>make build</code> again without changing any files then
Make is smart enough to know that nothing needs to be re-built.
</p>

<div class="org-src-container">

<pre class="src src-sh">make build
</pre>
</div>
<pre class="example">
make: Nothing to be done for `build'.
</pre>

<p>
If we change a file Make is smart enough to only re-build that single
file.
</p>

<div class="org-src-container">

<pre class="src src-sh">touch site/make.md ; make build
</pre>
</div>
<pre class="example">
node_modules/.bin/marked --input site/make.md --output _build/make/index.html
</pre>

<p>
And that's it.
</p>
</div>
</div>
